from config import OWNER_USERNAME, SUPPORT_GRP
from nexichat import nexichat
from pyrogram import Client, filters

START = """**
{} سلام من یک ربات سخنگو با پیروی از هوش مصنوعی هستم 💞

┏━━━━━━━━━━━━━━━┓
┃ ➪ من یک ربات سخنگو با پیروی از هوش مصنوعی هستم...
┃ ➪ لازم نیست چیزی یادم بدی خودم یاد میگیرم /lang
┃ ➪ این دستور واسه روشن و خاموش کردنم /chatbot
┗━━━━━━━━━━━━━━━┛

┏━━━━━•❃°•°❀•━━━━━┓
┣⪼ ๏ تعداد کاربران : {}
┣⪼ ๏ تعداد گروه‌ها : {}
┗━━━━━•❃°•°❀•━━━━━┛

╔═══════════════╗
║ ➻ سازنده من ➪ [░▒▓█سـٰٖـۘۘـلـٰٖـۘۘـٍٰ𓃭ـطـٰٖـان█▓▒░](https://t.me/Omid_yaphets)
║ ➻ کانال من ➪ [░▒▓█سـٰٖـۘۘـلـٰٖـۘۘـٍٰ𓃭ـطـٰٖـان█▓▒░](https://t.me/music_rock22)
╚═══════════════╝
**"""

HELP_READ = f"""**
برای اطلاعات بیشتر روی دکمه‌های زیر کلیک کنید. اگر مشکلی دارید می‌توانید از [░▒▓█سـٰٖـۘۘـلـٰٖـۘۘـٍٰ𓃭ـطـٰٖـان█▓▒░](https://t.me/Omid_yaphets) کمک بگیرید.

تمام دستورات با / قابل استفاده هستند.**
"""

TOOLS_DATA_READ = f"""**
๏ دستورات {nexichat.mention}:

➻ /start شروع گفتگو با ربات
──────────────
➻ /help راهنمای کامل دستورات
──────────────
➻ /ping بررسی آنلاین بودن ربات
──────────────
➻ /id دریافت شناسه کاربری
──────────────
➻ /broadcast ارسال پیام همگانی
مثال: `/broadcast -user -pin سلام دوستان`
──────────────
➻ /shayri دریافت جملات عاشقانه
──────────────
➻ /repo دریافت سورس ربات
──────────────
๏ ساخته شده توسط ➪ [░▒▓█سـٰٖـۘۘـلـٰٖـۘۘـٍٰ𓃭ـطـٰٖـان█▓▒░](https://t.me/Omid_yaphets) 💞**
"""

CHATBOT_READ = f"""**
๏ دستورات {nexichat.mention}:

➻ /chatbot - فعال/غیرفعال کردن ربات
──────────────
➻ /lang - تنظیم زبان چت
──────────────
➻ /resetlang - بازنشانی زبان به حالت ترکیبی
──────────────
➻ /ask - پرسیدن هر نوع سوال
──────────────
📡 ساخته شده توسط ➪ [░▒▓█سـٰٖـۘۘـلـٰٖـۘۘـٍٰ𓃭ـطـٰٖـان█▓▒░](https://t.me/Omid_yaphets) 💞**
"""

SOURCE_READ = f"""**سلام، سورس کد [{nexichat.name}](https://t.me/{nexichat.username}) در زیر آمده است.
لطفاً به ما ستاره ⭐ بدهید.
──────────────
[░▒▓█سـٰٖـۘۘـلـٰٖـۘۘـٍٰ𓃭ـطـٰٖـان█▓▒░](https://t.me/Omid_yaphets)
──────────────
در صورت بروز مشکل با [░▒▓█سـٰٖـۘۘـلـٰٖـۘۘـٍٰ𓃭ـطـٰٖـان█▓▒░](https://t.me/{SUPPORT_GRP}) تماس بگیرید.
<b>||©️ @{OWNER_USERNAME}||</b>**"""

ADMIN_READ = "به زودی"

ABOUT_READ = f"""**
➻ [{nexichat.name}](https://t.me/{nexichat.username}) یک ربات چت مبتنی بر هوش مصنوعی است.
➻ این ربات به صورت خودکار به کاربران پاسخ می‌دهد.
➻ به شما در مدیریت گروه‌هایتان کمک می‌کند.
➻ نوشته شده با [پایتون](https://www.python.org) و [مونگو دی‌بی](https://www.mongodb.com) 
──────────────
➻ برای دریافت راهنمایی و اطلاعات بیشتر درباره [{nexichat.name}](https://t.me/{nexichat.username}) روی دکمه‌های زیر کلیک کنید.
**"""
