from config import OWNER_USERNAME, SUPPORT_GRP
from nexichat import nexichat
from pyrogram import Client, filters



START = """**
{} سلام من یک ربات سخنگو با پیروی از هوش مصنوعی هستم 💞

┏━━━━━━━━━━━━━━━┓
┃ ➪ من یک ربات سخنگو با پیروی از هوش مصنوعی هستم...
┃ ➪ لازم نیست چیزی یادم بدی خودم یاد میگیرم /lang
┃ ➪ این دستور واسه روشن و خاموش کردنم /chatbot
┗━━━━━━━━━━━━━━━┛

┏━━━━━•❃°•°❀•━━━━━┓
┣⪼ ๏ ᴛᴏᴛᴀʟ ᴜꜱᴇʀꜱ : {}
┣⪼ ๏ ᴛᴏᴛᴀʟ ᴄʜᴀᴛꜱ : {}
┗━━━━━•❃°•°❀•━━━━━┛

╔═══════════════╗
║ ➻ این صاحابمه ➪ [༆꯭࿈꯭𝙆꯭𝙄꯭𝙉꯭𝙂꯭༑𝙎꯭𝙄꯭𝙉꯭𝘼꯭࿈꯭༆](https://t.me/Panel_Tornado)
║ ➻ اینم عشقمه ➪ [༆꯭࿈꯭𝙆꯭𝙄꯭𝙉꯭𝙂꯭༑𝙎꯭𝙄꯭𝙉꯭𝘼꯭࿈꯭༆](https://t.me/OWNER_ROYAL)
╚═══════════════╝
**"""

HELP_READ = f"""**
Cʟɪᴄᴋ ᴏɴ ᴛʜᴇ ʙᴜᴛᴛᴏɴs ʙᴇʟᴏᴡ ғᴏʀ ᴍᴏʀᴇ ɪɴғᴏʀᴍᴀᴛɪᴏɴ.  Iғ ʏᴏᴜ'ʀᴇ ғᴀᴄɪɴɢ ᴀɴʏ ᴘʀᴏʙʟᴇᴍ ʏᴏᴜ ᴄᴀɴ ᴀsᴋ ɪɴ [༆꯭࿈꯭𝙆꯭𝙄꯭𝙉꯭𝙂꯭༑𝙎꯭𝙄꯭𝙉꯭𝘼꯭࿈꯭༆](https://t.me/OWNER_ROYAL).

Aʟʟ ᴄᴏᴍᴍᴀɴᴅs ᴄᴀɴ ʙᴇ ᴜsᴇᴅ ᴡɪᴛʜ: /**
"""

TOOLS_DATA_READ = f"""**
๏ ʜᴇʀᴇ ᴀʀᴇ ᴛʜᴇ ᴄᴏᴍᴍᴀɴᴅs ғᴏʀ {nexichat.mention}:

➻ /start اینم که بزنی انقدر حرف میزنم که خسته بشی!
──────────────
➻ /help برای دریافت جزئیات در مورد تمام دستورات و ویژگی هاᴇs.
──────────────
➻ /ping ᴛᴏ ᴄʜᴇᴄᴋ ᴛʜᴇ ʀᴇsᴘᴏɴsᴇ ᴛɪᴍᴇ (ᴘɪɴɢ) ᴏғ ᴛʜᴇ ʙᴏᴛ!
──────────────
➻ /id رو طرف بزنی مسخصاتش بهت میدم.
──────────────
➻ /broadcast اینم واسه زمانی هست که من خیلی جاها هستم و پیام همگانی میدی ғʟᴀɢs!\nᴇxᴀᴍᴘʟᴇ: `/broadcast -user -pin ʜᴇʟʟᴏ ғʀɪᴇɴᴅs`
──────────────
➻ /shayri این دستور واسه جمله های عاشقانس
──────────────
➻ ᴜsᴇ /repo این که عشقم میاره
──────────────
๏ ᴍᴀᴅᴇ ʙʏ ➪ [༆꯭࿈꯭𝙆꯭𝙄꯭𝙉꯭𝙂꯭༑𝙎꯭𝙄꯭𝙉꯭𝘼꯭࿈꯭༆](https://t.me/OWNER_ROYAL) 💞**
"""

CHATBOT_READ = f"""**
๏ ʜᴇʀᴇ ᴀʀᴇ ᴛʜᴇ ᴄᴏᴍᴍᴀɴᴅs ғᴏʀ {nexichat.mention}:

➻ /chatbot - ᴏᴘᴇɴs ᴏᴘᴛɪᴏns ᴛᴏ ᴇɴᴀʙʟᴇ ᴏʀ ᴅɪsᴀʙʟᴇ ᴛʜᴇ ᴄʜᴀᴛʙᴏᴛ.
──────────────
➻ /lang, /language, /setlang - ᴏᴘᴇɴs ᴀ ᴍᴇɴᴜ ᴛᴏ sᴇʟᴇᴄᴛ ᴛʜᴇ ᴄʜᴀᴛ ʟᴀɴɢᴜᴀɢᴇ.  
──────────────
➻ /resetlang, /nolang - ʀᴇsᴇᴛs ᴛʜᴇ ʙᴏᴛ's ʟᴀɴɢᴜᴀɢᴇ ᴛᴏ ᴍɪxᴇᴅ ʟᴀɴɢᴜᴀɢᴇ.
──────────────
/ask - ᴀsᴋ ᴀɴʏ ᴛʏᴘᴇ ᴏғ ǫᴜᴇsᴛɪᴏɴs.
──────────────
📡 ᴍᴀᴅᴇ ʙʏ ➪ [༆꯭࿈꯭𝙆꯭𝙄꯭𝙉꯭𝙂꯭༑𝙎꯭𝙄꯭𝙉꯭𝘼꯭࿈꯭༆](https://t.me/OWNER_ROYAL) 💞**
"""

SOURCE_READ = f"**ʜᴇʏ, ᴛʜᴇ sᴏᴜʀᴄᴇ ᴄᴏᴅᴇ ᴏғ [{nexichat.name}](https://t.me/{nexichat.username}) ɪs ɢɪᴠᴇɴ ʙᴇʟᴏᴡ.**\n**ᴘʟᴇᴀsᴇ ғᴏʀᴋ ᴛʜᴇ ʀᴇᴘᴏ & ɢɪᴠᴇ ᴛʜᴇ sᴛᴀʀ ✯**\n**──────────────────**\n**ʜᴇʀᴇ ɪs ᴛʜᴇ [༆꯭࿈꯭𝙆꯭𝙄꯭𝙉꯭𝙂꯭༑𝙎꯭𝙄꯭𝙉꯭𝘼꯭࿈꯭༆](https://t.me/rainbow_tm)**\n**──────────────────**\n**ɪғ ʏᴏᴜ ғᴀᴄᴇ ᴀɴʏ ᴘʀᴏʙʟᴇᴍ ᴛʜᴇɴ ᴄᴏɴᴛᴀᴄᴛ ᴀᴛ [༆꯭࿈꯭𝙆꯭𝙄꯭𝙉꯭𝙂꯭༑𝙎꯭𝙄꯭𝙉꯭𝘼꯭࿈꯭༆](https://t.me/{SUPPORT_GRP}).\n<b>||©️ @{OWNER_USERNAME}||</b>"

ADMIN_READ = f"sᴏᴏɴ"

ABOUT_READ = f"""
**➻ [{nexichat.name}](https://t.me/{nexichat.username}) ɪs ᴀɴ ᴀɪ ʙᴀsᴇᴅ ᴄʜᴀᴛ-ʙᴏᴛ.**
**➻ [{nexichat.name}](https://t.me/{nexichat.username}) ʀᴇᴘʟɪᴇs ᴀᴜᴛᴏᴍᴀᴛɪᴄᴀʟʟʏ ᴛᴏ ᴀ ᴜsᴇʀ.**
**➻ ʜᴇʟᴘs ʏᴏᴜ ɪɴ ᴀᴄᴛɪᴠᴀᴛɪɴɢ ʏᴏᴜʀ ɢʀᴏᴜᴘs.**
**➻ ᴡʀɪᴛᴛᴇɴ ɪɴ [ᴘʏᴛʜᴏɴ](https://www.python.org) ᴡɪᴛʜ [ᴍᴏɴɢᴏ-ᴅʙ](https://www.mongodb.com) ᴀs ᴀ ᴅᴀᴛᴀʙᴀsᴇ**
**──────────────**
**➻ ᴄʟɪᴄᴋ ᴏɴ ᴛʜᴇ ʙᴜᴛᴛᴏɴs ɢɪᴠᴇɴ ʙᴇʟᴏᴡ ғᴏʀ ɢᴇᴛᴛɪɴɢ ʙᴀsɪᴄ ʜᴇʟᴩ ᴀɴᴅ ɪɴғᴏ ᴀʙᴏᴜᴛ [{nexichat.name}](https://t.me/{nexichat.username})**
"""
