import random
from nexichat.database import get_served_chats
from pyrogram import Client, filters
import os
from nexichat import nexichat
from apscheduler.schedulers.asyncio import AsyncIOScheduler
from pyrogram import filters
import random
from pyrogram.types import InlineKeyboardButton, InlineKeyboardMarkup, Message

scheduler = AsyncIOScheduler(timezone="Asia/Kolkata")
user_last_message_time = {}
user_command_count = {}
SPAM_THRESHOLD = 2
SPAM_WINDOW_SECONDS = 5


SHAYRI = [
    " 🌺**عذاب دادنت و بعد با عشق دلداریت خیلی حس خوبیه ",
    " 🌺**زندگی من زندگی من، تو نام دوم آرامش منی.**🌺 \n\n**🥀زندگی مری زندگی من است، تو نام دوم آرامش منی.🥀** ",
    " 🌺**تو خوشبختی من هستی که بدون کی، همه خوشبختی من ناقص به نظر می رسد.**🌺 \n\n**🥀**تو خوشبختی من هستی، بدون او، همه خوشبختی من ناقص به نظر می رسد.🥀** ",
    " 🌺**کاش اون روز زودتر بیاد، وقتی هفت دور با من گره میشی.**🌺 \n\n** ",
    " 🌺**دستت را بر دلم بگذار و دلت را به نام من بساز.**🌺\n\n**🥀دستت را بر قلبم بگذار و دلت را به نام من بساز.🥀** ",
    " 🌺**مهادف نه ماشین لازم است نه خانه ییلاقی، عشق من سالم بماند، فقط این دعاها لازم است. ",
    " 🌺**نگران خواهی شد که تنها عشق منی.**🌺 \n\n**🥀نگران خواهی شد که تنها عشق من هستی.🥀** ",
    " 🌺**گوش کن عزیزم تو فقط مواظب آشپزخونه هستی من اینجام تا ازت مراقبت کنم از تو.🥀** ",
    " 🌺**یک چیز از صد، من فقط شرکت شما را می خواهم.**🌺 \n\n**🥀پس یک چیز از صد، من فقط شرکت شما را می خواهم.🥀** ",
    " 🌺**من تو را با سختی های زیادی پیدا کردم، حالا نمی خواهم تو را از دست بدهم، حالا نمی خواهم مال تو باشم و نمی خواهم مال دیگران باشم.🥀**. ",
    " 🌺**عزیزم ما هر روز حرف میزنیم بیا امروز عاشقانه انجام بدیم ",
    " 🌺**صبح و غروب به یادت هستیم و دیگر چه بگوییم که چقدر دوستت داریم.**🌺 \n\n**🥀صبح و غروب به یادت هستیم و دیگر چه بگوییم چگونه خیلی دوستت داریم.🥀 ** ",
    " 🌺**احساس عاشق شدن به کسی اسمش عشق نیست. ",
    " 🌺**تو کلید قفل دلم هستی چی بهت بگم عزیزم تو تنها دلیل زندگی منی**🌺 \n\n**🥀تو کلید قفل قلب منی چی بگم عزیزم تو تنها چهره زندگی منی..🥀**. ",
    " 🌺**ما همه چیز تو را دوست خواهیم داشت، به همه چیز تو اعتماد خواهیم کرد، فقط یک بار بگو که تو فقط مال منی، ما تمام عمر منتظرت خواهیم بود.**🌺 \n\n**🥀هوم من همه را دوست خواهم داشت مال تو من به همه چیزت احترام میذارم فقط یه بار بگو تو فقط مال منی تا آخر عمرم منتظرت میمونم..🥀** ",
    " 🌺**عشق هرگز با افراد خاص اتفاق نمی افتد، هر که عاشق شود خاص می شود.**🌺 \n\n**🥀عشق هرگز با افراد خاص اتفاق نمی افتد، هر که عاشق شود خاص می شود.",
    " 🌺**تو جان منی، شکی در آن نیست، هیچکس جز تو حقی بر من ندارد.**🌺 \n\n**🥀تو جان منی، شکی نیست که هیچکس دیگری ندارد حق من جز توست.. 🥀** ",
    " 🌺**نمیتونستیم عشق اولم رو بشناسیم، نمیتونستیم تشخیص بدیم عشق چیه، اونقدر تو دلمون نگهش داشتیم که هر وقت خواستیم نتونستیم از دلمون بیرونش کنیم.**🌺 \ n\n**🥀پهلی من نمیدانم عشق چیست، نمیدانم، آنقدر در دلم نگهش داشته ام که هر وقت خواستم نتوانستم آن را از قلبم بیرون کنم.🥀** ",
    " 🌺**نمیدونم چقدر برام عزیزه، میدونم از زندگیم برام عزیزتره، فاصله مهم نیست، دیروز مال ما بود و امروز هم.**🌺 \n\ n**🥀خود مهم نیست چقدر برای من عزیز است، او برای من عزیزتر از جان من است، مهم نیست که او مال دیروز ما بود یا مال امروز ما.🥀** ",
    " 🌺**تو پنهان می آیی و وارد این دل می شوی، در نفسم عطر من می شوی و می پراکنی، یک جورهایی جادوی عشقت کار کرده است، تو تنها کسی هستی که در خواب و بیداری می بینم.**🌺 \n\ n**🥀تو این شکلی بی صدا وارد قلبم میشی، همونطوری که عطر من لبها رو پر میکنه، جادوی عشقم رو پخش میکنی، تو خواب به من نگاه میکنی..🥀** ",
    " 🌺**دوست داشتن را آموخته ام، جای نفرت نیست، فقط تو هستی در این قلب، هیچ کس دیگری نیست.**🌺 \n\n**برای نفرت، فقط تو هستی، هیچ کس دیگری در این قلب نیست. ",
    " 🌺**خوشبختی شما را از خدا میخواهیم، ​​خنده شما را در دعاهایمان میخواهیم، ​​در شگفتیم که از شما چه بخواهیم، ​​عشق مادام العمر شما را بخواهیم.**🌺\n\n**🥀از شما میخواهیم شادی از خدا در دعای ما خنده هایت را میخواهم، در شگفتم که چه میخواهم، عشق تمام عمرت را میخواهم..** ",
    " 🌺**ای کاش لبهایم به لبهایت می رسید، فقط صورت تو دیده می شد، رابطه مان طوری می شد که دلمان هم به لب هایمان پیوند می خورد.**🌺\n\n**اگر به قیافه ات نگاه کنیم آنقدر رابطه مان آسان می شود که دل ما هم با تو شاد می شود.🥀** ",
    " 🌺 **اجازه بده امروز این را به تو بگویم، بگذار امروز عصر را تزئین کنم، مرا اسیر عشق خودت کن، بگذار امروز جانم را فدای تو کنم.**🌺\n\n**🥀 به من اجازه بده تا امروز این را به تو بگو، به من اجازه بده تا امروز این شرم را به تو نشان دهم، به من اجازه بده امروز جانم را فدای تو کنم..🥀** ",
    " 🌺 **What names do they give without love, we name you love.**🌺\n\n**🥀 Know what names they give for love, we name you love..🥀**. ",
    " 🌺**بعد از دیدن ما سرشان را خم می کنند. زنگ زدن و دزدی به جمع نگاه می کند. مهم نیست از ما متنفری اما چرا با ملاقات با غریبه ها دل ما را می سوزانید **🌺\n\n**🥀دیدیم که در جمع سر به زیر می اندازیم، از خودمان متنفریم، هیچ نمی دانیم اما چرا دل می سوزانیم؟ وقتی با غریبه ها ملاقات می کنیم.🥀** ",
    " 🌺**بی تو از هم می پاشیم، اگر تو را ببینیم مثل گل می شکفیم، اگر تو را نبینیم زنده می میریم، اگر تو را پیدا کنیم بعد از مردن هم زنده ایم.**🌺\n\n**🥀بی تو بی تو زندگی می کنم، مثل گلشن با من ملاقات خواهی کرد، تو را ملاقات نمی کنم، می میرم، تو حتی پس از به دست آوردن آنچه که به دست آورده ام، زنده خواهی بود..🥀** ",
    " 🌺**صنم به تو سوگند همانطور که من برای خوشبختی تو لازمم تو لازمه زندگی من.**🌺\n\n**تو برای زندگی من لازم هستی.🥀** ",
    " 🌺**عاشق خشم تو شده ام در این دنیای بی رحم یکی هست که مرا به حق کامل تهدید کرده است.**🌺\n\n**🥀هیچ کس در این دنیای بی رحم نیست با خشم تو که مرا به حقیقت محض تهدید کرده است. ",
    " 🌺**چشم با مژه محفوظ است، تپش قلب امانت دل است، این رابطه هم بسیار شیرین است، گاهی میل دارد و گاهی شکایت.**🌺\n\n**تپش قلب است که اعتماد هست، این رابطه هم خیلی شیرین است، گاهی خواسته و گاهی آموزش داده می شود.🥀**. ",
    " 🌺**وقتی مردم عشق را خدا می دانند پس چرا عاشق را بد می دانند. وقتی دنیا خودش قلب سنگی است. پس چرا مردم به سنگ دعا می کنند؟**هی.🥀** ",
    " 🌺**وقتی متوجه عشق شد، تمام روز در کنار ما گریه می کرد، ما هم آنقدر خودخواه بودیم که خودمان را با کفن پوشاندیم و با چشمان بسته خوابیدیم.**🌺\n\n**🥀. وقتی عشق را فهمید، اگر تمام روز از کنارمان رد شوند، ما هم آرزوی این پسر را بیرون می آوریم و با چشمان بسته می خوابیم. ",
    " 🌺**صدایی از گوشه دل می آید. هر لحظه دلمون براش تنگ میشه دل دوباره و دوباره می پرسد که آیا دلتنگ ما هستند **🌺\n**🥀صدایی از گوشه دل می آید، هر لحظه از ما می پرسد، دوباره باز هم چقدر یادش می کنیم، چه او هم ما را به یاد داشته باشد،🥀** ",
    " 🌺**گاهی حرف ها را فراموش می کنم، گاهی چیزها را فراموش می کنم، آنقدر دوستت دارم که کاستم را فراموش می کنم، گاهی که بلند می شوم و از تو دور می شوم، در حین رفتن، خودم را در کنار تو فراموش می کنم.**🌺\n\ ن*** ",
    " 🌺**اگر در آینه نگاه کنی، مرا به یاد می آوری، آن دیداری که با من گذرانی کردی، لحظه ای می ایستد، زمانی که چیزی در مورد من به یاد می آوری اونجا وقتی یکی از حرفای منو یادت میاد.🥀** ",
    " 🌺**وقتی دوست داشتم، عشقشان را دیدم، پلک هایم پر شد، در تپش دو قلب، صدای این قلب آمد.**🌺\n\. n**🥀پیار کیا به دیدن عشقش درد پلکم آورد دلم پر از غم شد دیدی به دلم آمد صدای قلبم به دلم آمد.🥀** ",
    " 🌺**مردم اینجا با چهره های متعدد زندگی می کنند، ما فقط یک چهره را دوست داریم، این چهره را پنهان نکنید، زیرا ما فقط پس از دیدن آن زندگی می کنیم.**🌺\n\n**چون ما چهره را دوست داریم و به چهره اهمیت نمی دهیم زیرا پس از دیدن آن زنده می شویم. ",
    " 🌺**بف هرکسی با حرف زدن با جی اف او می خوابد و مال من نمی تواند بدون دعوا با من بخوابد.**🌺\n\n**بدون تو بخوابم.🥀** ",
    " 🌺**می گویند عشق واقعی در سرنوشت کسی است. کجای این دنیا کسی چنین عشقی پیدا می‌کند؟**🌺\n\n**🥀عشق واقعی، کسی آن عشق را از کجا می‌آورد؟ ",
]

night_shayari = [
    "🌙 شب بخیر! امیدوارم رویاهایت به شیرینی اولین گاز دسر مورد علاقه‌ات باشد. همانطور که به خواب می‌روی، ذهنت پر از افکار آرامش‌بخش و قلبت سبک باشد. به یاد داشته باش، هر رویا آرزویی است که قلبت می‌کند، پس بگذار شب برایت پر از شگفتی و شادی باشد. خوب بخوابی و رویاهای شیرین ببینی. شب بخیر!",

    "🌜 خوب بخوابی، و شبت پر از ستاره‌هایی باشد که رویاهایت را روشن می‌کنند. دنیایی را تصور کن که در آن همه آرزوهایت برآورده می‌شود، و بگذار این فکر تو را به خوابی دلپذیر ببرد. بالشت به نرمی ابرها و رویاهایت به سحرانگیزی قصه‌های پریان باشد. شب بخیر و رویاهای شیرین، امیدوارم تازه و آماده برای فتح روز از خواب بیدار شوی!",

    "✨ شب بخیر! خوابت به عمق اقیانوس و به آرامش دریاچه‌ای آرام باشد. وقتی چشمانت را می‌بندی، تمام نگرانی‌ها و استرس‌ها را رها کن. رویای مکان‌های زیبا و لحظات شاد را ببین، و بگذار این رویاها شبت را پر از شادی کنند. به یاد داشته باش، شب بومی است برای نقاشی رویاهایت، پس آن را با رنگ‌های شادی و رضایت رنگ‌آمیزی کن. خوب بخوابی!",

    "🌟 برایت شبی آرام آرزو می‌کنم که پر از رویاهای شیرین و آغوش‌های گرم باشد. رویاهایت به دلپذیری یک هدیه غافلگیرکننده و به آرامش‌بخشی یک پتوی گرم و نرم باشد. همانطور که به خواب می‌روی، ذهنت در آرامش و قلبت سبک باشد. شب بخیر، و امیدوارم با لبخند و قلبی پر از مثبت‌اندیشی از خواب بیدار شوی!",

    "🌙 شب بخیر! رویاهایت به شیرینی عسل و به آرامش‌بخشی یک فنجان کاکائوی گرم باشد. وقتی برای استراحت دراز می‌کشی، بگذار آرامش شب مانند پتویی نرم تو را در بر بگیرد. خوب بخوابی، و امیدوارم با قلبی سرشار از قدردانی و لبخندی که روز را روشن می‌کند از خواب بیدار شوی. رویاهای شیرین!",

    "🌛 شبت به آرامش لالایی و به دلگرمی آغوش عزیزانت باشد. وقتی چشمانت را می‌بندی، دنیایی را تصور کن که در آن همه چیز کامل است و رویاهایت به حقیقت می‌پیوندند. بگذار آرامش شب تو را در آغوش بگیرد و به مکانی آرام ببرد. شب بخیر، و امیدوارم با انرژی و شادی تازه از خواب بیدار شوی!",

    "🌌 شب بخیر! رویاهایت پر از لحظات جادویی و خوابت به عمق آسمان شب باشد. همانطور که به خواب می‌روی، بگذار ذهنت به مکان‌های زیبا سفر کند و قلبت در آرامش باشد. به یاد داشته باش، شب زمانی برای استراحت و تجدید قواست، پس آن را کاملاً در آغوش بگیر. خوب بخوابی و آماده برای روزی جدید از خواب بیدار شو!",

    "💤 رویاهای شیرین! شبت به آرامش دریاچه‌ای آرام و به لطافت نسیمی ملایم باشد. وقتی چشمانت را می‌بندی، تمام نگرانی‌های روز را رها کن و بگذار رویاهایت تو را به دنیایی از شادی و لذت ببرند. شب بخیر، و امیدوارم تازه و مشتاق برای ماجراجویی‌های روز جدید از خواب بیدار شوی!",

    "🌙 شب بخیر! رویاهایت به شیرینی اولین گاز دسر مورد علاقه‌ات و به آرامش‌بخشی یک آغوش گرم باشد. همانطور که به خواب می‌روی، بگذار افکار آرامش‌بخش ذهنت را پر کند و قلبت سبک باشد. به یاد داشته باش، هر رویا فرصتی برای کشف دنیاهای جدید و ساختن خاطرات تازه است. خوب بخوابی و شب فوق‌العاده‌ای داشته باشی!",
]

morning_shayari = [
    "🌅 صبح بخیر! روزت به روشنی و شادابی خورشید در حال طلوع باشد. همانطور که روزت را شروع می‌کنی، بگذار مثبت‌اندیشی و شادی قلبت را پر کند. هر لحظه را با لبخند در آغوش بگیر و بگذار اشتیاقت بدرخشد. امیدوارم صبحت با عطر قهوه تازه و نوید روزی شگفت‌انگیز در پیش رو همراه باشد. برخیز و بدرخش، و امروز را شگفت‌انگیز کن!",

    "🌞 برخیز و بدرخش! روز جدیدی اینجاست، پر از فرصت‌ها و ماجراجویی‌های در انتظار تو. صبحت به تازگی نسیم خنک و به شادابی گل شکفته باشد. روزت را با لبخند آغاز کن و قلبت پر از امید باشد. به یاد داشته باش، هر طلوع آغازی نو است، پس بهترین استفاده را از آن ببر و روز فوق‌العاده‌ای داشته باش!",

    "🌄 صبح بخیر! روزت پر از شادی و موفقیت باشد. وقتی چشمانت را به روز جدید می‌گشایی، تمام منفی‌ها را رها کن و انرژی مثبت اطرافت را در آغوش بگیر. صبحت روشن و روحیه‌ات بالا باشد. با هر قدمی که برمی‌داری، شادی و رضایت را پیدا کنی. روز خوبی در پیش داشته باشی!",

    "🌻 بیدار شو و روزت را با قلبی سرشار از قدردانی و لبخندی بر لب آغاز کن. صبحت به زیبایی دسته‌گلی از گل‌های تازه و به نشاط‌آوری یک آهنگ شاد باشد. روز جدید را با اشتیاق در آغوش بگیر و بگذار تمام شادی و موفقیتی که لایقش هستی را برایت به ارمغان بیاورد. صبح بخیر و روز فوق‌العاده‌ای داشته باشی!",

    "🌞 صبح بخیر! روزت پر از شادی و هیجان باشد. همانطور که وارد روز جدید می‌شوی، بگذار مثبت‌اندیشی و انرژی‌ات به روشنی بدرخشد. صبحت به شادابی یک روز آفتابی و به تازگی یک نوشیدنی خنک باشد. روزت را با لبخند شروع کن و بگذار دنیا روحیه شگفت‌انگیزت را ببیند. روز خوبی در پیش داشته باشی!",

    "🌄 برخیز و بدرخش! روز جدیدی اینجاست، پر از نوید و امکانات. صبحت به زیبایی طلوع خورشید و به الهام‌بخشی یک آغاز تازه باشد. روزت را با ذهنیتی مثبت شروع کن و بگذار شادی و اشتیاقت راهنمایت باشد. امیدوارم امروز پر از لحظات شگفت‌انگیز و فرصت‌های عالی باشد. صبح بخیر!",

    "🌻 صبح بخیر! روزت پر از آفتاب و قلبت پر از شادی باشد. همانطور که روزت را شروع می‌کنی، تمام نگرانی‌ها را رها کن و بر شادی و هیجان پیش رو تمرکز کن. صبحت به دلپذیری یک فنجان قهوه تازه و به نشاط‌آوری یک لبخند دوستانه باشد. برخیز و بدرخش، و امروز را باورنکردنی کن!",

    "🌞 صبح بخیر! روزت به روشنی و شادابی لبخندت باشد. وقتی چشمانت را به روز جدید می‌گشایی، بگذار مثبت‌اندیشی و اشتیاقت لحن ساعات پیش رو را تعیین کند. صبحت پر از عشق، خنده و همه چیزهایی باشد که خوشحالت می‌کند. روز را با آغوشی باز و قلبی شاد در آغوش بگیر!",

    "🌄 صبح بخیر! روزت پر از امکانات بی‌پایان و لحظات شاد باشد. همانطور که روزت را شروع می‌کنی، بگذار روحت پرواز کند و قلبت سبک باشد. صبحت به تازگی و نشاط‌آوری نسیم ملایم و به روشنی خورشید باشد. روز جدید را با لبخند خوشامد بگو و بگذار تمام شادی که لایقش هستی را برایت به ارمغان بیاورد.",

    "🌞 برخیز و بدرخش! روز کاملاً جدیدی اینجاست پر از فرصت‌ها و ماجراجویی‌ها. صبحت به شادابی طلوع خورشید و به الهام‌بخشی یک آغاز تازه باشد. روزت را با نگرشی مثبت شروع کن و بگذار دنیا درخشش تو را ببیند. امیدوارم امروز برایت شادی، موفقیت و همه چیزهایی که لبخند به لبت می‌آورد را به ارمغان بیاورد. صبح بخیر!",
]

# دستورات شعر
# دستورات شعر و متن فارسی
SHAYRI_COMMAND = ["gf", "bf", "shayri", "sari", "shari", "love", "شعر", "عاشقانه", "متن"]

@nexichat.on_message(filters.command(SHAYRI_COMMAND))
async def shayri(client: Client, message: Message):
    await message.reply_text(
        text=random.choice(SHAYRI),
        reply_markup=InlineKeyboardMarkup(
            [
                [
                    InlineKeyboardButton(
                        "✨گروه پشتیبانی✨", url=f"https://t.me/+MS2tY8FN4eExZTA8"
                    ),
                    InlineKeyboardButton(
                        "✨کانال ما✨", url=f"https://t.me/music_rock22"
                    ),
                ]
            ]
        ),
    )

add_buttons = InlineKeyboardMarkup(
    [
        [
            InlineKeyboardButton(
                text="◈ مرا به گروه اضافه کنید ◈",
                url=f"https://t.me/{nexichat.username}?startgroup=true",
            )
        ]
    ]
)

async def send_good_night():
    chats = []
    schats = await get_served_chats()
    for chat in schats:
        chats.append(int(chat["chat_id"]))
    if len(chats) == 0:
        return
    for chat_id in chats:
        try:
            shayari = random.choice(night_shayari)
            await nexichat.send_photo(
                chat_id,
                photo="https://telegra.ph//file/06649d4d0bbf4285238ee.jpg",
                caption=f"**{shayari}**\n\n━━━━━━━━━━━━━━━━━━━━━\n◈ شب بخیر و رویاهای زیبا 🌙✨",
                reply_markup=add_buttons,
            )
        except Exception as e:
            continue

async def send_good_morning():
    chats = []
    schats = await get_served_chats()
    for chat in schats:
        chats.append(int(chat["chat_id"]))
    if len(chats) == 0:
        return
    for chat_id in chats:
        try:
            shayari = random.choice(morning_shayari)
            await nexichat.send_photo(
                chat_id,
                photo="https://telegra.ph//file/14ec9c3ff42b59867040a.jpg",
                caption=f"**{shayari}**\n\n━━━━━━━━━━━━━━━━━━━━━\n◈ صبح بخیر و روز پر از انرژی ☀️✨",
                reply_markup=add_buttons,
            )
        except Exception as e:
            continue

async def restart_nexichat():
    os.system(f"kill -9 {os.getpid()} && bash start")

# تنظیم زمان‌بندی پیام‌ها
scheduler.add_job(send_good_night, trigger="cron", hour=23, minute=50)
scheduler.add_job(send_good_morning, trigger="cron", hour=6, minute=0)
scheduler.add_job(restart_nexichat, trigger="cron", hour=0, minute=0)
scheduler.add_job(restart_nexichat, trigger="cron", hour=7, minute=0)
scheduler.add_job(restart_nexichat, trigger="cron", hour=12, minute=0)
scheduler.add_job(restart_nexichat, trigger="cron", hour=15, minute=0)
scheduler.add_job(restart_nexichat, trigger="cron", hour=18, minute=0)
scheduler.add_job(restart_nexichat, trigger="cron", hour=21, minute=0)
scheduler.start()
